#include<iostream>
using namespace std;
int fun(int x)
{
	int num = 0;//用来计数的变量，一定要记得初始化
	int f[10] = { 6,2,5,5,4,5,6,3,7,6 };//用一个数组来记录0-9每个数字需要用多少根火柴棍
	while (x / 10 != 0)//如果x/10的商不为0的话，说明这个数至少有两位
	{
		//获取x的末尾的数字并将此数所需要的火柴棍根数累加到num中
		num += f[x%10];
		x = x / 10;//去掉x末尾的数字，例如x的值为123则现在x的值为12
	}
	//最后加上此时x所需要用到的火柴棍的根数(此时x一定是一位数)
	num += f[x];
	return num;//返回需要火柴棍的总根数
}
int main()
{
	int a, b,c;
	int sum = 0;//sum用来计数的，因此一定要初始化为0
	int m;//火柴棍个数
	cin >> m;
	//开始枚举a和b
	for (int a = 0; a <= 1111; a++)
	{
		for (int b = 0; b <= 1111; b++)
		{
			c = a + b;//计算出c
			//fun是我们上面写的函数，返回一个数所需要的火柴棍的总数
			//当a使用的火柴棍根数+b使用的火柴棍根数+c使用的火柴棍根数之和恰好等于m-4时，则成功找出一组解(因为+号和=号分别用两根火柴)
			if (fun(a) + fun(b) + fun(c) == m - 4)
			{
				cout << a << "+" << b << "=" << c << endl;
				sum++;
			}
		}
	}
	cout << endl;
	cout << "一共可以拼出" << sum << "个不同的等式";
	return 0;
}